app/views/statuses/_listing.html.haml

SELECT COUNT(*) FROM `statuses`
---
  .pull-left.paginate
    = [statuses.total_count.to_s, t('model.status').downcase].join(" ")