app/views/statuses/index.html.haml

    .col-xs-3
      = text_field_tag :q, nil, placeholder: t('status.search'), class: 'form-control', 'data-provide' => 'typeahead', klass: "statuses"
---
SELECT `statuses`.* FROM `statuses`