app/views/issues/_form.html.haml

= simple_form_for @issue, :html => {:class => 'form-horizontal well'} do |f|
	= f.input :status, collection: Status.all, selected: @issue.status
	= f.input :category, collection: Category.all, selected: @issue.category, prompt: t('categories.select_one')
---
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = ? ORDER BY `statuses`.`id` ASC LIMIT 1  [["id", 1]]
SELECT `categories`.* FROM `categories`