app/views/issues/_listing.html.haml

	.pull-left.paginate
		= [issues.total_count.to_s, t('model.issue').downcase].join(" ")
---
SELECT COUNT(*) FROM `issues` WHERE (description LIKE '%te%')