app/controllers/categories_controller.rb

  def index
		@objects = Category.order(Category.sort_column).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `categories` LIMIT 25 OFFSET 0) subquery_for_count
SELECT `categories`.* FROM `categories` LIMIT 25 OFFSET 0

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`created_at`, `description`, `name`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Sep 2013 12:06:18 UTC +00:00], ["description", "test"], ["name", "test"], ["updated_at", Thu, 26 Sep 2013 12:06:18 UTC +00:00]]