app/controllers/issues_controller.rb

  def index
		@objects = Issue.order(Issue.sort_column).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `issues` LIMIT 25 OFFSET 0) subquery_for_count
SELECT `issues`.* FROM `issues` LIMIT 25 OFFSET 0

  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save
---
INSERT INTO `issues` (`app_status`, `created_at`, `description`, `detailed_cause`, `duration_1`, `duration_2`, `end_time`, `formal_description`, `problem`, `reactivity`, `report_date`, `start_time`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @issue.update(issue_params)
---
UPDATE `issues` SET `report_date` = ?, `duration_1` = ?, `duration_2` = ?, `reactivity` = ?, `app_status` = ?, `updated_at` = ? WHERE `issues`.`id` = 1

    def set_issue
      @issue = Issue.find(params[:id])
---
SELECT `issues`.* FROM `issues` WHERE `issues`.`id` = ? LIMIT 1  [["id", "1"]]