app/controllers/statuses_controller.rb

  def index
    @objects = Status.order(Status.sort_column).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `statuses` LIMIT 25 OFFSET 0) subquery_for_count
SELECT `statuses`.* FROM `statuses` LIMIT 25 OFFSET 0

  def create
    @status = Status.new(status_params)

    if @status.save
---
INSERT INTO `statuses` (`created_at`, `description`, `name`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Sep 2013 11:54:19 UTC +00:00], ["description", "test"], ["name", "test"], ["updated_at", Thu, 26 Sep 2013 11:54:19 UTC +00:00]]

  def update
    if @status.update(status_params)
---
UPDATE `statuses` SET `name` = ?, `description` = ?, `updated_at` = ? WHERE `statuses`.`id` = 4  [["name", "Résolu"], ["description", "qmsdjfqmkls"], ["updated_at", Thu, 26 Sep 2013 11:59:00 UTC +00:00]]

  def destroy
    name = @status.name
    @status.destroy
---
DELETE FROM `statuses` WHERE `statuses`.`id` = ?  [["id", 12]]

  def set_status
    @status = Status.find(params[:id])
---
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = ? LIMIT 1  [["id", "12"]]