app/views/categories/_listing.html.haml

  .pull-left.paginate
    = [categories.total_count.to_s, t('model.category').downcase].join(" ")
---
SELECT COUNT(*) FROM `categories`